ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_wss.c
/******************************************************************************
* Function Name: Cy_BLE_WSSS_WriteEventHandler
***************************************************************************//**
*
*  Handles Write Request Event for Weight Scale Service.
*
*  \param eventParam: The pointer to the data structure specified by the event.
*
* \return
*  Return value is of type cy_en_ble_gatt_err_code_t.
*   * CY_BLE_GATT_ERR_NONE - Write is successful.
*   * CY_BLE_GATT_ERR_REQUEST_NOT_SUPPORTED - The request is not supported.
*   * CY_BLE_GATT_ERR_INVALID_HANDLE - 'handleValuePair.attrHandle' is not valid.
*   * CY_BLE_GATT_ERR_WRITE_NOT_PERMITTED - The write operation is not permitted on
*                                          this attribute.
*   * CY_BLE_GATT_ERR_INVALID_OFFSET - The offset value is invalid.
*   * CY_BLE_GATT_ERR_UNLIKELY_ERROR - Some other error occurred.
*
******************************************************************************/
static cy_en_ble_gatt_err_code_t Cy_BLE_WSSS_WriteEventHandler(const cy_stc_ble_gatts_write_cmd_req_param_t *eventParam)
{
    cy_en_ble_gatt_err_code_t gattErr = CY_BLE_GATT_ERR_NONE;
    uint32_t event = (uint32_t)CY_BLE_EVT_WSSS_INDICATION_DISABLED;

    if(Cy_BLE_WSS_ApplCallback != NULL)
    {
        /* Client Characteristic Configuration descriptor write request */
        if(eventParam->handleValPair.attrHandle ==
           cy_ble_wssConfigPtr->wsss->charInfo[CY_BLE_WSS_WEIGHT_MEASUREMENT].descrHandle[CY_BLE_WSS_CCCD])
        {
            cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
            {
                .handleValuePair = eventParam->handleValPair,
                .connHandle      = eventParam->connHandle,
                .offset          = 0u,
                .flags           = CY_BLE_GATT_DB_PEER_INITIATED
            };

            if(CY_BLE_IS_INDICATION_ENABLED_IN_PTR(eventParam->handleValPair.value.val))
            {
                event = (uint32_t)CY_BLE_EVT_WSSS_INDICATION_ENABLED;
            }
            gattErr = Cy_BLE_GATTS_WriteAttributeValueCCCD(&dbAttrValInfo);

            if(gattErr == CY_BLE_GATT_ERR_NONE)
            {
                cy_stc_ble_wss_char_value_t wrReqParam =
                {
                    .connHandle = eventParam->connHandle,
                    .charIndex  = CY_BLE_WSS_WEIGHT_MEASUREMENT,
                    .value      = NULL
                };
                Cy_BLE_WSS_ApplCallback(event, &wrReqParam);
            }

        #if ((CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL) && \
            (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES))
            /* Set flag to store bonding data to flash */
            if(cy_ble_peerBonding[eventParam->connHandle.attId] == CY_BLE_GAP_BONDING)
            {
                cy_ble_pendingFlashWrite |= CY_BLE_PENDING_CCCD_FLASH_WRITE_BIT;
            }
        #endif /* (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES) */

            /* Clear callback flag indicating that request was handled */
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
        }
    }

    return(gattErr);
}


/******************************************************************************
* Function Name: Cy_BLE_WSSS_ConfirmationEventHandler
***************************************************************************//**
*
*  Handles a Value Confirmation request event from the BLE stack.
*
*  \param eventParam: The pointer to a structure of type cy_stc_ble_conn_handle_t.
*
******************************************************************************/
static void Cy_BLE_WSSS_ConfirmationEventHandler(const cy_stc_ble_conn_handle_t *eventParam)
{
    if((Cy_BLE_WSS_ApplCallback != NULL) && (CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE != cy_ble_wsssReqHandle))
    {
        /* Only Weight Measurement Characteristic has the Indication property. Check if
         * the requested handle is the handle of the Descriptor Value Change handle.
         */
        if(cy_ble_wsssReqHandle == cy_ble_wssConfigPtr->wsss->charInfo[CY_BLE_WSS_WEIGHT_MEASUREMENT].charHandle)
        {
            /* Fill in event data and inform Application about successfully
             * confirmed indication.
             */
            cy_stc_ble_wss_char_value_t locCharValue =
            {
                .connHandle = *eventParam,
                .charIndex  = CY_BLE_WSS_WEIGHT_MEASUREMENT,
                .value      = NULL
            };
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
            cy_ble_wsssReqHandle = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
            Cy_BLE_WSS_ApplCallback((uint32_t)CY_BLE_EVT_WSSS_INDICATION_CONFIRMED, &locCharValue);
        }
    }
}


#if (CY_BLE_GAP_ROLE_PERIPHERAL)

/******************************************************************************
* Function Name: Cy_BLE_WSS_SetAdUserId
***************************************************************************//**
*
*  Sets the User ID List to the advertisement packet. To be able to set the
*  User ID List with this function, the advertisement packet should be
*  configured in the component GUI to include Weight Scale Service UUID in the
*  Service Data field. The Service Data should have enough room to fit the
*  User ID List that is planned to be advertised. To reserve the room for the
*  User ID List, the Service Data for WSS should be filled with Unknown User
*  ID - 0xFF. The amount of 0xFF's should be equal to User List Size that is
*  planned to be advertised.
*  This function must be called when Cy_BLE_GetBleSsState() returns
*  CY_BLE_BLESS_STATE_EVENT_CLOSE state.
*
*  \param listSize: The size of the User List.
*  \param userIdList: The array contains a User List.
*  \param advertisingParamIndex: The index of the peripheral and broadcast
*                                configuration in customizer. For example:
*  * CY_BLE_PERIPHERAL_CONFIGURATION_0_INDEX     0x00
*  * CY_BLE_BROADCASTER_CONFIGURATION_0_INDEX    0x01
*
* \return
*  A return value is of type cy_en_ble_api_result_t.
*  * CY_BLE_SUCCESS - The request handled successfully.
*  * CY_BLE_ERROR_INVALID_PARAMETER - On NULL pointer, Data length in input
*                parameter exceeds maximum advertisement packet length.
*  * CY_BLE_ERROR_INVALID_OPERATION - The advertisement packet doesn't contain
*                the User List or it is to small or ADV Event is not closed.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_WSS_SetAdUserId(uint8_t listSize,
                                              const uint8_t userIdList[],
                                              uint8_t advertisingParamIndex)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_ERROR_INVALID_OPERATION;
    uint32_t i;
    uint32_t fFlag = 0u;
    uint8_t adLength = 0u;
    uint8_t byteCounter = 0u;

    if((advertisingParamIndex >= CY_BLE_GAPP_CONF_COUNT) || (userIdList == NULL) ||
       (listSize > (CY_BLE_GAP_MAX_ADV_DATA_LEN - CY_BLE_AD_SERVICE_DATA_OVERHEAD)))
    {
        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    }
    else
    {
        while((byteCounter < cy_ble_configPtr->discoveryModeInfo[advertisingParamIndex].advData->advDataLen) &&
              (fFlag == 0u))
        {
            adLength = cy_ble_configPtr->discoveryModeInfo[advertisingParamIndex].advData->advData[byteCounter];

