ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_wss.c
            if(adLength != 0u)
            {
                uint16_t servUuid;

                /* Increment byte counter so that it points to AD type field */
                byteCounter++;

                servUuid = Cy_BLE_Get16ByPtr(&cy_ble_configPtr->discoveryModeInfo[advertisingParamIndex].advData->
                                              advData[byteCounter + 1u]);

                /* Check if "Service Data" AD type is found and service UUID is WSS UUID */
                if((cy_ble_configPtr->discoveryModeInfo[advertisingParamIndex].advData->advData[byteCounter] ==
                    CY_BLE_AD_TYPE_SERVICE_DATA) && (servUuid == CY_BLE_UUID_WEIGHT_SCALE_SERVICE))
                {
                    /* WSS Service Data was found. Set flag and exit the loop. */
                    fFlag = 1u;
                }
                else
                {
                    byteCounter += adLength;
                }
            }
            else
            {
                /* End of advertisement data structure was encountered so exit loop. */
                break;
            }
        }
        if(fFlag != 0u)
        {
            /* Check if there is enough space to fit user index list */
            if((adLength - CY_BLE_AD_SERVICE_DATA_OVERHEAD) >= listSize)
            {
                /* Increment byte counter so that it points to data value */
                byteCounter += CY_BLE_AD_SERVICE_DATA_OVERHEAD;

                for(i = 0u; i < ((uint32_t)adLength - CY_BLE_AD_SERVICE_DATA_OVERHEAD); i++)
                {
                    if(i <= listSize)
                    {
                        /* Copy user index element to advertisement data byte */
                        cy_ble_configPtr->discoveryModeInfo[advertisingParamIndex].advData->advData[byteCounter + i] =
                            userIdList[i];
                    }
                    else
                    {
                        /* Fill remaining bytes with "Unknown User" ID */
                        cy_ble_configPtr->discoveryModeInfo[advertisingParamIndex].advData->advData[byteCounter + i] =
                            CY_BLE_WSS_UNKNOWN_USER;
                    }
                }

                /* We are done. Indicate success. */
                apiResult = CY_BLE_SUCCESS;

                if((Cy_BLE_GetAdvertisementState() == CY_BLE_ADV_STATE_ADVERTISING) &&
                   (cy_ble_advIndex == advertisingParamIndex))
                {
                    /* Update the advertisement packet if the device is in the advertising mode. */
                    apiResult = Cy_BLE_GAPP_UpdateAdvScanData(&cy_ble_configPtr->discoveryModeInfo[cy_ble_advIndex]);
                }
            }
        }
    }

    return(apiResult);
}


/******************************************************************************
* Function Name: Cy_BLE_WSS_GetAdUserIdListSize
***************************************************************************//**
*
*  Returns the size (in bytes) of User ID List in the advertisement packet.
*
*  \param advertisingParamIndex: The index of the peripheral and broadcast
*                                configuration in customizer. For example:
*  * CY_BLE_PERIPHERAL_CONFIGURATION_0_INDEX     0x00
*  * CY_BLE_BROADCASTER_CONFIGURATION_0_INDEX    0x01
*
* \return
*  Size of User ID List.
*
******************************************************************************/
uint8_t Cy_BLE_WSS_GetAdUserIdListSize(uint8_t advertisingParamIndex)
{
    uint8_t uiCount = 0u;
    uint8_t adLength = 0u;
    uint32_t fFlag = 0u;
    uint8_t byteCounter = 0u;

    if(advertisingParamIndex >= CY_BLE_GAPP_CONF_COUNT)
    {
        uiCount = 0u;
    }
    else
    {
        while((byteCounter < cy_ble_configPtr->discoveryModeInfo[advertisingParamIndex].advData->advDataLen))
        {
            adLength = cy_ble_configPtr->discoveryModeInfo[advertisingParamIndex].advData->advData[byteCounter];

            if(adLength != 0u)
            {
                uint16_t servUuid;

                /* Increment byte counter so that it points to AD type field */
                byteCounter++;

                servUuid = Cy_BLE_Get16ByPtr(&cy_ble_configPtr->discoveryModeInfo[advertisingParamIndex].advData->
                                              advData[byteCounter + 1u]);

                /* Check if "Service Data" AD type is found and service UUID is WSS UUID */
                if((cy_ble_configPtr->discoveryModeInfo[advertisingParamIndex].advData->advData[byteCounter] ==
                    CY_BLE_AD_TYPE_SERVICE_DATA) && (servUuid == CY_BLE_UUID_WEIGHT_SCALE_SERVICE))
                {
                    /* WSS Service Data was found. Set flag and exit the loop. */
                    fFlag = 1u;
                }
                else
                {
                    byteCounter += adLength;
                }
            }
            else
            {
                /* End of advertisement data structure was encountered so exit loop. */
                break;
            }
        }
        if(fFlag != 0u)
        {
            uiCount = adLength - CY_BLE_AD_SERVICE_DATA_OVERHEAD;
        }
    }

    return(uiCount);
}

#endif /* (CY_BLE_GAP_ROLE_PERIPHERAL) */


/******************************************************************************
* Function Name: Cy_BLE_WSSS_SetCharacteristicValue
***************************************************************************//**
*
*  Sets a value for one of two characteristic values of the Weight Scale
*  Service. The characteristic is identified by charIndex.
*
*  \param charIndex: The index of a Weight Scale Service characteristic.
*  \param attrSize:  The size of the characteristic value attribute.
*  \param attrValue: The pointer to the characteristic value data that should be
*                    stored to the GATT database.
*
* \return
*  A return value is of type cy_en_ble_api_result_t.
*   * CY_BLE_SUCCESS - The characteristic value was written successfully.
*   * CY_BLE_ERROR_INVALID_PARAMETER - Validation of the input parameters failed.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_WSSS_SetCharacteristicValue(cy_en_ble_wss_char_index_t charIndex,
                                                          uint8_t attrSize,
                                                          uint8_t *attrValue)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
    {
        .handleValuePair.value.len = attrSize,
        .handleValuePair.value.val = attrValue,
        .offset                    = 0u,
        .flags                     = CY_BLE_GATT_DB_LOCALLY_INITIATED
    };

